/* Viewcontrollers */

/* Waypoint viewcontroller */
"waypointviewcontroller-DNF" = "DNF";
"waypointviewcontroller-Found" = "Found";
"waypointviewcontroller-Waypointflags" = "Waypoint flags";
"waypointviewcontroller-areyousure?" = "Are you sure?";
"waypointviewcontroller-attributes" = "Attributes";
"waypointviewcontroller-description" = "Description";
"waypointviewcontroller-exportsuccessful" = "Export Successful";
"waypointviewcontroller-fieldsnotes" = "Fields Notes";
"waypointviewcontroller-groupmembers" = "Group Members";
"waypointviewcontroller-highlight" = "Highlight";
"waypointviewcontroller-hint" = "Hint";
"waypointviewcontroller-ignored" = "Ignored";
"waypointviewcontroller-images" = "Images";
"waypointviewcontroller-inprogress" = "In Progress";
"waypointviewcontroller-inventory" = "Inventory";
"waypointviewcontroller-logs" = "Logs";
"waypointviewcontroller-logthiswaypoint" = "Log this waypoint";
"waypointviewcontroller-markas__" = "Mark as %1@";
"waypointviewcontroller-noneyet" = "None yet";
"waypointviewcontroller-personalnote" = "Personal Note";
"waypointviewcontroller-planned" = "Planned";
"waypointviewcontroller-removeastarget" = "Remove as target";
"waypointviewcontroller-removemarkas__" = "Remove mark as %1@";
"waypointviewcontroller-selectagroup" = "Select a group";
"waypointviewcontroller-setastarget" = "Set as target";
"waypointviewcontroller-theexportedfilecanbefoundinthefilessection" = "The exported file can be found in the Files section";
"waypointviewcontroller-unabletoupdatethewaypoint." = "Unable to update the waypoint.";
"waypointviewcontroller-updatefailed" = "Update failed";
"waypointviewcontroller-updating__" = "Updating %1@";
"waypointviewcontroller-waypointactions" = "Waypoint actions";
"waypointviewcontroller-waypointdata" = "Waypoint data";
"waypointviewcontroller-waypoints" = "Waypoints";
"waypointviewcontroller-word" = "word";
"waypointviewcontroller-words" = "words";

/* WaypointImages viewcontroller */
"waypointimagesviewcontroller-imagesfromthelogs" = "Images from the logs";
"waypointimagesviewcontroller-imagesfromthewaypoint" = "Images from the waypoint";
"waypointimagesviewcontroller-logimages" = "Log Images";
"waypointimagesviewcontroller-userimages" = "User Images";
"waypointimagesviewcontroller-waypointimages" = "Waypoint Images";

/* WaypointAttributes viewcontroller */
"waypointattributesviewcontroller-attributes" = "Attributes";

/* WaypointGroups viewcontroller */
"waypointgroupsviewcontroller-systemgroups" = "System Groups";
"waypointgroupsviewcontroller-usergroups" = "User Groups";

/* WaypointTrackables viewcontroller */
"waypointtrackablesviewcontroller-trackables" = "Trackables";

/* WaypointPersonalNote viewcongtroller */
"waypointpersonalnoteviewcontroller-copysuccessful" = "Copy successful";
"waypointpersonalnoteviewcontroller-enteryourpersonalnotehere" = "Enter your personal note here";
"waypointpersonalnoteviewcontroller-personalnote" = "Personal note";
"waypointpersonalnoteviewcontroller-thetextofthepersonalnotehasbeencopiedtotheclipboard" = "The text of the personal note has been copied to the clipboard";
"waypointpersonalnoteviewcontroller-updateofpersonalnotehasfailed" = "Update of personal note has failed";
"waypointpersonalnoteviewcontroller-updatingpersonalnote" = "Updating personal note";

/* Navigate - Compass */
"compassviewcontroller-accuracy" = "Accuracy";
"compassviewcontroller-altitude" = "Altitude";
"compassviewcontroller-mylocation" = "My Location";
"compassviewcontroller-D" = "D";
"compassviewcontroller-T" = "T";

/* Waypoints - Filters - Viewcontroller */
"filtersviewcontroller-accounts" = "Accounts";
"filtersviewcontroller-date" = "Date";
"filtersviewcontroller-difficulty" = "Difficulty";
"filtersviewcontroller-direction" = "Direction";
"filtersviewcontroller-distance" = "Distance";
"filtersviewcontroller-favourites" = "Favourites";
"filtersviewcontroller-filtername" = "Filter name";
"filtersviewcontroller-flags" = "Flags";
"filtersviewcontroller-groups" = "Groups";
"filtersviewcontroller-savefilteras..." = "Save filter as...";
"filtersviewcontroller-sizes" = "Sizes";
"filtersviewcontroller-terrain" = "Terrain";
"filtersviewcontroller-text" = "Text";
"filtersviewcontroller-types" = "Types";

/* Waypoints - Filters - Fiters */
"filtertableviewcell-any__" = "All %@";
"filtertableviewcell-selected__" = "Selected %@";
"filterdatetableviewcell-after" = "After";
"filterdatetableviewcell-before" = "Before";
"filterdatetableviewcell-date" = "Date";
"filterdatetableviewcell-lastlog" = "Last log";
"filterdatetableviewcell-on" = "On";
"filterdatetableviewcell-placedon" = "Placed on";

/* Waypoints - List */
"waypointslistviewcontroller-areyousure?" = "Are you sure?";
"waypointslistviewcontroller-deletewaypoints" = "Delete waypoints";
"waypointslistviewcontroller-downloadingfor__" = "Downloading for %@";
"waypointslistviewcontroller-exportsuccessful" = "Export successful";
"waypointslistviewcontroller-refreshingdatabase" = "Refreshing database";
"waypointslistviewcontroller-theexportedfilecanbefoundinthefilessection" = "The exported file can be found in the Files section";
"waypointslistviewcontroller-updatefailed" = "Update failed";
"waypointslistviewcontroller-waypoint" = "Waypoint";
"waypointslistviewcontroller-waypoints" = "Waypoints";

/* Files - Local Files */
"filesviewcontroller-fileage" = "File age";
"filesviewcontroller-filesize" = "File size";
"filesviewcontroller-lastimported" = "Last imported";
"filesviewcontroller-chooseyouraction" = "Choose Your Action";
"filesviewcontroller-delete" = "Delete";
"filesviewcontroller-import" = "Import";
"filesviewcontroller-rename" = "Rename";
"filesviewcontroller-restore" = "Restore";
"filesviewcontroller-unzip" = "Unzip";
"filesviewcontroller-uploadtoicloud" = "Upload to iCloud";
"filesviewcontroller-uploadwithairdrop" = "Upload with Airdrop";
"filesviewcontroller-geocubeimportof__" = "Geocube Import of %@";
"filesviewcontroller-importfailed" = "Import Failed";
"filesviewcontroller-importsuccessful" = "Import Successful";
"filesviewcontroller-makesurethatyouhaveatleasthavedefinedoneuseraccount.gotosettings->accountsanddefineanusername." = "Make sure that you at least have defined one user account. Go to Settings -> Accounts and define an username.";
"filesviewcontroller-makesurethereareusergroupsdefined.gotogroups->UserGroupsandaddagroup." = "Make sure there are user groups defined. Go to Groups -> User Groups and add a group.";
"filesviewcontroller-prerequisitefailed" = "Prerequisite failed";
"filesviewcontroller-rename__to" = "Rename %@ to";
"filesviewcontroller-renamefile" = "Rename File";
"filesviewcontroller-selectagroup" = "Select a group";
"filesviewcontroller-selectthesource" = "Select the source";
"filesviewcontroller-theimportwassuccessful." = "The import was successful.";
"filesviewcontroller-therewasaproblemimportingthefile__." = "There was a problem importing the file %@.";

/* Files - File browser */
"filebrowserviewcontroller-chooseyouraction" = "Choose Your Action";
"filebrowserviewcontroller-retrievingdirectorycontents" = "Retrieving directory contents";
"filebrowserviewcontroller-uploadtoicloud" = "Upload to iCloud";
"filebrowserviewcontroller-uploadwithairdrop" = "Upload with Airdrop";

/* Browser - Browser */
"browserbrowserviewcontroller-downloadcomplete" = "Download complete";
"browserbrowserviewcontroller-downloaded__for__.YoucanfinditintheFilesmenu." = "Downloaded %@ for %@. You can find it in the Files menu.";
"browserbrowserviewcontroller-downloadingquery" = "Downloading query";
"browserbrowserviewcontroller-enterurl" = "Enter URL";
"browserbrowserviewcontroller-failedtodownload" = "Failed to download";

/* Browser - User */
"browseruserviewcontroller-URL" = "URL";
"browseruserviewcontroller-createbookmark" = "Create bookmark";
"browseruserviewcontroller-enterthebookmark" = "Enter the bookmark";
"browseruserviewcontroller-enterthebookmarkdetails" = "Enter the bookmark details";
"browseruserviewcontroller-name" = "Name";
"browseruserviewcontroller-selectyouchoice" = "Select you choice";
"browseruserviewcontroller-updatebookmark" = "Update bookmark";
:
/* Tools - GPS */
"toolsgpsviewcontroller-average" = "Average";
"toolsgpsviewcontroller-last" = "Last";
"toolsgpsviewcontroller-lastdistancetoaverage" = "Last distance to average";
"toolsgpsviewcontroller-copysuccessful" = "Copy successful";
"toolsgpsviewcontroller-thecoordinateshavebeencopiedtotheclipboard" = "The coordinates have been copied to the clipboard.";

/* Tools - ROT13 */
"toolsrot13viewcontroller-enteryourtexthere..." = "Enter your text here...";
"toolsrot13viewcontroller-ragrelbhegrkgurer..." = "Ragre lbhe grkg urer...";

/* Help - Introduction */
"helpintroduction-title1" = "Welcome to Geocube";
"helpintroduction-text1" = "Please go through this quick introduction to understand the UI.";
"helpintroduction-title2" = "Menus and tabs";
"helpintroduction-text2" = "The red arrow points to the global menu.\nThe brown arrow points to the local menu for this tab.\nThe green arrows point to the tabs.\nThe menu can be larger than your screen, you can scroll in it!";
"helpintroduction-title3" = "How to close a window";
"helpintroduction-text3" = "When you see a close button at the top left, you can either tap it or swipe left on page to close it.\n\n(Does the left swipe not work? Tap the close button!)";
"helpintroduction-title4" = "Map icons";
"helpintroduction-text4" = "- Follow me with auto-zoom.\n- Follow me, do not zoom.\n- Show both me and the target.\n- Show target, do not zoom.\n- Show target and zoom in.\n\nTry them when you are at the map!";
"helpintroduction-title5" = "Happy geocaching!";
"helpintroduction-text5" = "You can watch this introduction again in the Help tab of the Help menu.";
